[Killed] Null coalescing mutation (remove left)
blog/blog.api/Controllers/PostController.cs:21:23
 
         public PostController(ILogger<PostController> logger, IPostService postService, CurrentUser currentUser)
         {
-            _logger = logger ?? throw new ArgumentNullException(nameof(logger));
+            _logger = logger;
             _postService = postService ?? throw new ArgumentNullException(nameof(postService));
             _currentUser = currentUser ?? throw new ArgumentNullException(nameof(currentUser));
killedBy: blog.api.test.PostControllerTest.Initialize

[Killed] Null coalescing mutation (remove left)
blog/blog.api/Controllers/PostController.cs:22:28
         public PostController(ILogger<PostController> logger, IPostService postService, CurrentUser currentUser)
         {
             _logger = logger ?? throw new ArgumentNullException(nameof(logger));
-            _postService = postService ?? throw new ArgumentNullException(nameof(postService));
+            _postService = postService;
             _currentUser = currentUser ?? throw new ArgumentNullException(nameof(currentUser));
         }
killedBy: blog.api.test.PostControllerTest.Initialize

[Killed] Null coalescing mutation (remove left)
blog/blog.api/Controllers/PostController.cs:23:28
         {
             _logger = logger ?? throw new ArgumentNullException(nameof(logger));
             _postService = postService ?? throw new ArgumentNullException(nameof(postService));
-            _currentUser = currentUser ?? throw new ArgumentNullException(nameof(currentUser));
+            _currentUser = currentUser;
         }
 
killedBy: blog.api.test.PostControllerTest.Initialize

[Killed] Array initializer mutation
blog/blog.api/Controllers/PostController.cs:34:51
         {
             try
             {
-                return Ok(await _postService.List(new PostStatus[] { PostStatus.Approved }));
+                return Ok(await _postService.List(new PostStatus[] {}));
             }
             catch (Exception e)
killedBy: blog.api.test.PostControllerTest.ListPostsSuccess

[Killed] Block removal mutation
blog/blog.api/Controllers/PostController.cs:37:13
                 return Ok(await _postService.List(new PostStatus[] { PostStatus.Approved }));
             }
             catch (Exception e)
-            {
-                return BadRequest(new ErrorMessage(e.Message));
-            }
+            {}
         }
 
killedBy: blog.api.test.PostControllerTest.ListPostsFail

[Killed] Block removal mutation
blog/blog.api/Controllers/PostController.cs:66:13
         public async Task<IActionResult> GetById([FromRoute] long postId)
         {
             try
-            {
-                return Ok(await _postService.GetById(_currentUser.Id, postId));
-            }
+            {}
             catch (NotFoundException e)
             {
killedBy: blog.api.test.PostControllerTest.GetPostByIdFail; blog.api.test.PostControllerTest.GetPostByIdNotFound

[Killed] Block removal mutation
blog/blog.api/Controllers/PostController.cs:70:13
                 return Ok(await _postService.GetById(_currentUser.Id, postId));
             }
             catch (NotFoundException e)
-            {
-                return NotFound(new ErrorMessage(e.Message));
-            }
+            {}
             catch (Exception e)
             {
killedBy: blog.api.test.PostControllerTest.GetPostByIdNotFound

[Killed] Block removal mutation
blog/blog.api/Controllers/PostController.cs:88:13
         public async Task<IActionResult> GetByOwner()
         {
             try
-            {
-                return Ok(await _postService.ListByOwner(_currentUser.Id));
-            }
+            {}
             catch (NotFoundException e)
             {
killedBy: blog.api.test.PostControllerTest.GetMinePostsFail; blog.api.test.PostControllerTest.GetMinePostsNotFound

[Killed] Block removal mutation
blog/blog.api/Controllers/PostController.cs:110:13
         public async Task<IActionResult> Post([FromBody] PostInput post)
         {
             try
-            {
-                return Ok(await _postService.Add(post));
-            }
+            {}
             catch (Exception e)
             {
killedBy: blog.api.test.PostControllerTest.AddPostFail; blog.api.test.PostControllerTest.AddPostSuccess; blog.api.test.PostControllerTest.ApprovePostFail

[Killed] Block removal mutation
blog/blog.api/Controllers/PostController.cs:127:13
         public async Task<IActionResult> Edit([FromRoute] long postId, [FromBody] PostInput post)
         {
             try
-            {
-                return Ok(await _postService.Edit(postId, post));
-            }
+            {}
             catch (Exception e)
             {
killedBy: blog.api.test.PostControllerTest.EditPostFail; blog.api.test.PostControllerTest.EditPostSuccess

[Killed] Block removal mutation
blog/blog.api/Controllers/PostController.cs:144:13
         public async Task<IActionResult> Submit([FromRoute] long postId)
         {
             try
-            {
-                return Ok(await _postService.Submit(postId));
-            }
+            {}
             catch (Exception e)
             {
killedBy: blog.api.test.PostControllerTest.ApprovePostSuccess; blog.api.test.PostControllerTest.CommentPostSuccess; blog.api.test.PostControllerTest.ListPendingPostsSuccess

[Killed] Block removal mutation
blog/blog.api/Controllers/PostController.cs:161:13
         public async Task<IActionResult> Approve([FromRoute] long postId)
         {
             try
-            {
-                return Ok(await _postService.Approve(postId));
-            }
+            {}
             catch (Exception e)
             {
killedBy: blog.api.test.PostControllerTest.ApprovePostFail; blog.api.test.PostControllerTest.ApprovePostSuccess; blog.api.test.PostControllerTest.CommentPostSuccess

[Killed] Block removal mutation
blog/blog.api/Controllers/PostController.cs:178:13
         public async Task<IActionResult> Reject([FromRoute] long postId, [FromBody] CommentInput comment)
         {
             try
-            {
-                return Ok(await _postService.Reject(postId, comment));
-            }
+            {}
             catch (Exception e)
             {
killedBy: blog.api.test.PostControllerTest.RejectPostFail; blog.api.test.PostControllerTest.RejectPostSuccess

[Killed] Block removal mutation
blog/blog.api/Controllers/PostController.cs:194:13
         public async Task<IActionResult> Comment([FromRoute] long postId, [FromBody] CommentInput comment)
         {
             try
-            {
-                return Ok(await _postService.Comment(postId, comment));
-            }
+            {}
             catch (Exception e)
             {
killedBy: blog.api.test.PostControllerTest.CommentPostFail; blog.api.test.PostControllerTest.CommentPostSuccess
