[Killed] Negate expression
blog/blog.api/Middleware/AuthorizeFilter.cs:17:17
         {
             // skip authorization if action is decorated with [AuthorizeFilter, AllowAnonymous] attribute
             var allowAnonymous = context.ActionDescriptor.EndpointMetadata.OfType<AllowAnonymousAttribute>().Any();
-            if (allowAnonymous)
+            if (!(allowAnonymous))
                 return;
 
killedBy: blog.api.test.AuthorizationFilterTest.AuthorizeFilterAuthenticationAnonymousAttributeMethod; blog.api.test.AuthorizationFilterTest.AuthorizeFilterAuthenticationExceptionNoHeader; blog.api.test.AuthorizationFilterTest.AuthorizeFilterAuthenticationRequestHasInvalidCredential

[Killed] Statement mutation
blog/blog.api/Middleware/AuthorizeFilter.cs:18:17
             // skip authorization if action is decorated with [AuthorizeFilter, AllowAnonymous] attribute
             var allowAnonymous = context.ActionDescriptor.EndpointMetadata.OfType<AllowAnonymousAttribute>().Any();
             if (allowAnonymous)
-                return;
+                ;
 
             try
killedBy: blog.api.test.AuthorizationFilterTest.AuthorizeFilterAuthenticationAnonymousAttributeMethod

[Killed] Object initializer mutation
blog/blog.api/Middleware/AuthorizeFilter.cs:35:38
                 if (user == null)
                 {
                     // not logged in - return 401 unauthorized
-                    context.Result = new JsonResult(new { message = "Unauthorized" }) { StatusCode = StatusCodes.Status401Unauthorized };
+                    context.Result = new JsonResult(new { message = "Unauthorized" }) {};
                 }
                 else
killedBy: blog.api.test.AuthorizationFilterTest.AuthorizeFilterAuthenticationUserNotFound

[Killed] Linq method mutation (FirstOrDefault() to First())
blog/blog.api/Middleware/AuthorizeFilter.cs:39:45
                 }
                 else
                 {
-                    var requestPermission = context.ActionDescriptor.EndpointMetadata.OfType<HasPermission>().FirstOrDefault();
+                    var requestPermission = context.ActionDescriptor.EndpointMetadata.OfType<HasPermission>().First();
                     if (requestPermission != null)
                     {
killedBy: blog.api.test.AuthorizationFilterTest.AuthorizeFilterAuthenticationUserFound

[Killed] Equality mutation
blog/blog.api/Middleware/AuthorizeFilter.cs:40:25
                 else
                 {
                     var requestPermission = context.ActionDescriptor.EndpointMetadata.OfType<HasPermission>().FirstOrDefault();
-                    if (requestPermission != null)
+                    if (requestPermission == null)
                     {
                         if (user.Role.Contains(requestPermission.Role) == false)
killedBy: blog.api.test.AuthorizationFilterTest.AuthorizeFilterAuthenticationRequestHasPermissionFail; blog.api.test.AuthorizationFilterTest.AuthorizeFilterAuthenticationRequestHasPermissionSuccess; blog.api.test.AuthorizationFilterTest.AuthorizeFilterAuthenticationUserFound

[Killed] Boolean mutation
blog/blog.api/Middleware/AuthorizeFilter.cs:42:75
                     var requestPermission = context.ActionDescriptor.EndpointMetadata.OfType<HasPermission>().FirstOrDefault();
                     if (requestPermission != null)
                     {
-                        if (user.Role.Contains(requestPermission.Role) == false)
+                        if (user.Role.Contains(requestPermission.Role) == true)
                         {
                             // not logged in - return 401 unauthorized
killedBy: blog.api.test.AuthorizationFilterTest.AuthorizeFilterAuthenticationRequestHasPermissionFail; blog.api.test.AuthorizationFilterTest.AuthorizeFilterAuthenticationRequestHasPermissionSuccess

[Killed] Equality mutation
blog/blog.api/Middleware/AuthorizeFilter.cs:42:29
                     var requestPermission = context.ActionDescriptor.EndpointMetadata.OfType<HasPermission>().FirstOrDefault();
                     if (requestPermission != null)
                     {
-                        if (user.Role.Contains(requestPermission.Role) == false)
+                        if (user.Role.Contains(requestPermission.Role) != false)
                         {
                             // not logged in - return 401 unauthorized
killedBy: blog.api.test.AuthorizationFilterTest.AuthorizeFilterAuthenticationRequestHasPermissionFail; blog.api.test.AuthorizationFilterTest.AuthorizeFilterAuthenticationRequestHasPermissionSuccess

[Killed] Equality mutation
blog/blog.api/Middleware/AuthorizeFilter.cs:50:33
                         else
                         {
                             var currentUser = context.HttpContext.RequestServices.GetService(typeof(CurrentUser)) as CurrentUser;
-                            if (currentUser != null)
+                            if (currentUser == null)
                             {
                                 currentUser.Id = user.ID;
killedBy: blog.api.test.AuthorizationFilterTest.AuthorizeFilterAuthenticationRequestHasPermissionSuccess

[Killed] Block removal mutation
blog/blog.api/Middleware/AuthorizeFilter.cs:51:29
                         {
                             var currentUser = context.HttpContext.RequestServices.GetService(typeof(CurrentUser)) as CurrentUser;
                             if (currentUser != null)
-                            {
-                                currentUser.Id = user.ID;
-                            }
+                            {}
                         }
                     }
killedBy: blog.api.test.AuthorizationFilterTest.AuthorizeFilterAuthenticationRequestHasPermissionSuccess

[Killed] String mutation
blog/blog.api/Middleware/AuthorizeFilter.cs:60:65
             }
             catch
             {
-                context.Result = new JsonResult(new { message = "Unauthorized" }) { StatusCode = StatusCodes.Status401Unauthorized };
+                context.Result = new JsonResult(new { message = "" }) { StatusCode = StatusCodes.Status401Unauthorized };
             }
 
killedBy: blog.api.test.AuthorizationFilterTest.AuthorizeFilterAuthenticationExceptionNoHeader; blog.api.test.AuthorizationFilterTest.AuthorizeFilterAuthenticationRequestHasInvalidCredential
