[Killed] Null coalescing mutation (remove left)
blog/blog.api/Controllers/UserController.cs:19:28
         public UserController(ILogger<UserController> logger, IUserService userService)
         {
             _logger = logger ?? throw new ArgumentNullException(nameof(logger));
-            _userService = userService ?? throw new ArgumentNullException(nameof(userService));
+            _userService = userService;
         }
 
killedBy: blog.api.test.UserControllerTest.Initialize

[Killed] Block removal mutation
blog/blog.api/Controllers/UserController.cs:30:13
         public async Task<IActionResult> Get()
         {
             try
-            {
-                return Ok(await _userService.List());
-            }
+            {}
             catch (Exception e)
             {
killedBy: blog.api.test.UserControllerTest.ListUsersFail; blog.api.test.UserControllerTest.ListUsersSuccess

[Killed] Block removal mutation
blog/blog.api/Controllers/UserController.cs:48:13
         public async Task<IActionResult> GetById([FromRoute] long userId)
         {
             try
-            {
-                return Ok(await _userService.GetById(userId));
-            }
+            {}
             catch (NotFoundException e)
             {
killedBy: blog.api.test.UserControllerTest.GetUserByIdFail; blog.api.test.UserControllerTest.GetUserByIdNotFound

[Killed] Block removal mutation
blog/blog.api/Controllers/UserController.cs:70:13
         public async Task<IActionResult> GetByUserName([FromRoute] string username)
         {
             try
-            {
-                return Ok(await _userService.GetByUsername(username));
-            }
+            {}
             catch (NotFoundException e)
             {
killedBy: blog.api.test.UserControllerTest.GetUserByUsernameFail; blog.api.test.UserControllerTest.GetUserByUsernameNotFound

[Killed] Block removal mutation
blog/blog.api/Controllers/UserController.cs:92:13
         public async Task<IActionResult> Post([FromBody] User user)
         {
             try
-            {
-                return Ok(await _userService.Save(user));
-            }
+            {}
             catch (Exception e)
             {
killedBy: blog.api.test.UserControllerTest.AddUserFail; blog.api.test.UserControllerTest.AddUserSuccess
