[Survived] Statement mutation
blog/blog.api/Database/DBContextBlog.cs:21:13
 
         protected override void OnModelCreating(ModelBuilder modelBuilder)
         {
-            modelBuilder.Entity<User>()
-            .HasKey(p => new { p.ID });
+            ;
 
             modelBuilder.Entity<User>().Property(b => b.ID)

[Survived] Statement mutation
blog/blog.api/Database/DBContextBlog.cs:24:13
             modelBuilder.Entity<User>()
             .HasKey(p => new { p.ID });
 
-            modelBuilder.Entity<User>().Property(b => b.ID)
-                .ValueGeneratedOnAdd();
+            ;
 
             modelBuilder.Entity<User>().Property(b => b.Username)

[Survived] Statement mutation
blog/blog.api/Database/DBContextBlog.cs:27:13
             modelBuilder.Entity<User>().Property(b => b.ID)
                 .ValueGeneratedOnAdd();
 
-            modelBuilder.Entity<User>().Property(b => b.Username)
-                .IsRequired();
+            ;
             modelBuilder.Entity<User>().Property(b => b.Name)
                 .IsRequired();

[Survived] Statement mutation
blog/blog.api/Database/DBContextBlog.cs:29:13
 
             modelBuilder.Entity<User>().Property(b => b.Username)
                 .IsRequired();
-            modelBuilder.Entity<User>().Property(b => b.Name)
-                .IsRequired();
+            ;
             modelBuilder.Entity<User>().Property(b => b.Email)
                 .IsRequired();

[Survived] Statement mutation
blog/blog.api/Database/DBContextBlog.cs:31:13
                 .IsRequired();
             modelBuilder.Entity<User>().Property(b => b.Name)
                 .IsRequired();
-            modelBuilder.Entity<User>().Property(b => b.Email)
-                .IsRequired();
+            ;
             modelBuilder.Entity<User>().Property(b => b.Password)
                 .IsRequired();

[Survived] Statement mutation
blog/blog.api/Database/DBContextBlog.cs:33:13
                 .IsRequired();
             modelBuilder.Entity<User>().Property(b => b.Email)
                 .IsRequired();
-            modelBuilder.Entity<User>().Property(b => b.Password)
-                .IsRequired();
+            ;
 
             modelBuilder.Entity<User>().Property(e => e.Role)

[Killed] Statement mutation
blog/blog.api/Database/DBContextBlog.cs:36:13
             modelBuilder.Entity<User>().Property(b => b.Password)
                 .IsRequired();
 
-            modelBuilder.Entity<User>().Property(e => e.Role)
-                .HasConversion(
-                  v => string.Join(",", v.Select(e => e.ToString("D")).ToArray()),
-                  v => v.Split(new[] { ',' })
-                    .Select(e => Enum.Parse(typeof(UserRole), e))
-                    .Cast<UserRole>()
-                    .ToList());
+            ;
 
             modelBuilder.Entity<PostDB>()
killedBy: blog.api.test.PostControllerTest.AddPostSuccess

[Survived] String mutation
blog/blog.api/Database/DBContextBlog.cs:38:66
 
             modelBuilder.Entity<User>().Property(e => e.Role)
                 .HasConversion(
-                  v => string.Join(",", v.Select(e => e.ToString("D")).ToArray()),
+                  v => string.Join(",", v.Select(e => e.ToString("")).ToArray()),
                   v => v.Split(new[] { ',' })
                     .Select(e => Enum.Parse(typeof(UserRole), e))

[Survived] Statement mutation
blog/blog.api/Database/DBContextBlog.cs:44:13
                     .Cast<UserRole>()
                     .ToList());
 
-            modelBuilder.Entity<PostDB>()
-            .HasKey(p => new { p.ID });
+            ;
 
             modelBuilder.Entity<PostDB>().Property(b => b.ID)

[Survived] Statement mutation
blog/blog.api/Database/DBContextBlog.cs:47:13
             modelBuilder.Entity<PostDB>()
             .HasKey(p => new { p.ID });
 
-            modelBuilder.Entity<PostDB>().Property(b => b.ID)
-                .ValueGeneratedOnAdd();
+            ;
             modelBuilder.Entity<PostDB>()
                 .Property(b => b.DatePublished)

[Survived] Statement mutation
blog/blog.api/Database/DBContextBlog.cs:49:13
 
             modelBuilder.Entity<PostDB>().Property(b => b.ID)
                 .ValueGeneratedOnAdd();
-            modelBuilder.Entity<PostDB>()
-                .Property(b => b.DatePublished)
-                .ValueGeneratedOnAdd();
+            ;
 
             modelBuilder.Entity<PostDB>().Property(b => b.Content)

[Survived] Statement mutation
blog/blog.api/Database/DBContextBlog.cs:53:13
                 .Property(b => b.DatePublished)
                 .ValueGeneratedOnAdd();
 
-            modelBuilder.Entity<PostDB>().Property(b => b.Content)
-                .IsRequired();
+            ;
             modelBuilder.Entity<PostDB>().Property(b => b.Title)
                 .IsRequired();

[Survived] Statement mutation
blog/blog.api/Database/DBContextBlog.cs:55:13
 
             modelBuilder.Entity<PostDB>().Property(b => b.Content)
                 .IsRequired();
-            modelBuilder.Entity<PostDB>().Property(b => b.Title)
-                .IsRequired();
+            ;
             modelBuilder.Entity<PostDB>().Property(b => b.OwnerId)
                 .IsRequired();

[Survived] Statement mutation
blog/blog.api/Database/DBContextBlog.cs:57:13
                 .IsRequired();
             modelBuilder.Entity<PostDB>().Property(b => b.Title)
                 .IsRequired();
-            modelBuilder.Entity<PostDB>().Property(b => b.OwnerId)
-                .IsRequired();
+            ;
 
             modelBuilder.Entity<PostDB>()

[Survived] Statement mutation
blog/blog.api/Database/DBContextBlog.cs:60:13
             modelBuilder.Entity<PostDB>().Property(b => b.OwnerId)
                 .IsRequired();
 
-            modelBuilder.Entity<PostDB>()
-                .HasMany(e => e.Comments)
-                .WithOne()
-                .HasForeignKey(e => e.PostId)
-                .HasPrincipalKey(e => e.ID);
+            ;
 
             modelBuilder.Entity<PostDB>()

[Survived] Statement mutation
blog/blog.api/Database/DBContextBlog.cs:66:13
                 .HasForeignKey(e => e.PostId)
                 .HasPrincipalKey(e => e.ID);
 
-            modelBuilder.Entity<PostDB>()
-                .HasOne<User>()
-                .WithMany()
-                .HasForeignKey(e => e.OwnerId)
-                .IsRequired();
+            ;
 
 

[Survived] Statement mutation
blog/blog.api/Database/DBContextBlog.cs:73:13
                 .IsRequired();
 
 
-            base.OnModelCreating(modelBuilder);
+            ;
         }
 

[Killed] Equality mutation
blog/blog.api/Database/DBContextBlog.cs:79:34
         public override async Task<int> SaveChangesAsync(CancellationToken cancellationToken)
         {
             var entities = from e in ChangeTracker.Entries()
-                           where e.State == EntityState.Added
+                           where e.State != EntityState.Added
                                || e.State == EntityState.Modified
                            select e.Entity;
killedBy: blog.api.test.PostRepositoryTest.TestRepositoryShouldAddPostInvalidContentOrTitle(null,"a"); blog.api.test.PostRepositoryTest.TestRepositoryShouldAddPostInvalidContentOrTitle("a",null); blog.api.test.PostRepositoryTest.TestRepositoryShouldAddPostInvalidContentOrTitle(null,null)

[Killed] Logical mutation
blog/blog.api/Database/DBContextBlog.cs:79:34
         public override async Task<int> SaveChangesAsync(CancellationToken cancellationToken)
         {
             var entities = from e in ChangeTracker.Entries()
-                           where e.State == EntityState.Added
-                               || e.State == EntityState.Modified
+                           where e.State == EntityState.Added
+                               && e.State == EntityState.Modified
                            select e.Entity;
             foreach (var entity in entities)
killedBy: blog.api.test.PostRepositoryTest.TestRepositoryShouldAddPostInvalidContentOrTitle(null,"a"); blog.api.test.PostRepositoryTest.TestRepositoryShouldAddPostInvalidContentOrTitle("a",null); blog.api.test.PostRepositoryTest.TestRepositoryShouldAddPostInvalidContentOrTitle(null,null)

[Survived] Equality mutation
blog/blog.api/Database/DBContextBlog.cs:80:35
         {
             var entities = from e in ChangeTracker.Entries()
                            where e.State == EntityState.Added
-                               || e.State == EntityState.Modified
+                               || e.State != EntityState.Modified
                            select e.Entity;
             foreach (var entity in entities)

[Killed] Statement mutation
blog/blog.api/Database/DBContextBlog.cs:85:17
             foreach (var entity in entities)
             {
                 var validationContext = new ValidationContext(entity);
-                Validator.ValidateObject(
-                    entity,
-                    validationContext,
-                    validateAllProperties: true);
+                ;
             }
 
killedBy: blog.api.test.PostRepositoryTest.TestRepositoryShouldAddPostInvalidContentOrTitle(null,"a"); blog.api.test.PostRepositoryTest.TestRepositoryShouldAddPostInvalidContentOrTitle("a",null); blog.api.test.PostRepositoryTest.TestRepositoryShouldAddPostInvalidContentOrTitle(null,null)

[Survived] Boolean mutation
blog/blog.api/Database/DBContextBlog.cs:88:44
                 Validator.ValidateObject(
                     entity,
                     validationContext,
-                    validateAllProperties: true);
+                    validateAllProperties: false);
             }
 

[Survived] Boolean mutation
blog/blog.api/Database/DBContextBlog.cs:91:82
                     validateAllProperties: true);
             }
 
-            return await base.SaveChangesAsync(cancellationToken).ConfigureAwait(false);
+            return await base.SaveChangesAsync(cancellationToken).ConfigureAwait(true);
 }
     }
