[Killed] Block removal mutation
blog/blog.api/Model/ErrorMessage.cs:7:9
     {
 
         public ErrorMessage(string message)
-        {
-            Error = message;
-        }
+        {}
         public string Error { get; set; }
     }
killedBy: blog.api.test.ModelTest.ErrorMessageModel
