[Killed] String mutation
blog/blog.api/Model/PostDB.cs:11:45
         [DatabaseGenerated(DatabaseGeneratedOption.Identity)]
         public long ID { get; set; }
         [Required]
-        public string Title { get; set; } = string.Empty;
+        public string Title { get; set; } = "Stryker was here!";
         [Required]
         public string Content { get; set; } = string.Empty;
killedBy: blog.api.test.ModelTest.PostDBModel
