[Killed] String mutation
blog/blog.api/Model/User.cs:11:44
         [DatabaseGenerated(DatabaseGeneratedOption.Identity)]
         public long ID { get; set; }
         [Required]
-        public string Name { get; set; } = string.Empty;
+        public string Name { get; set; } = "Stryker was here!";
         [Required]
         public string Username { get; set; } = string.Empty;
killedBy: blog.api.test.ModelTest.UserModel
