[Killed] Block removal mutation
blog/blog.api/Repository/PostRepository.cs:12:9
     {
         private readonly DBContextBlog db;
         public PostRepository(DBContextBlog db)
-        {
-            this.db = db;
-        }
+        {}
 
         public async Task<IEnumerable<PostDB>> List(PostStatus[] status)
killedBy: blog.api.test.PostControllerTest.AddPostSuccess; blog.api.test.PostControllerTest.ApprovePostFail; blog.api.test.PostControllerTest.ApprovePostSuccess

[Survived] Equality mutation
blog/blog.api/Repository/PostRepository.cs:18:123
 
         public async Task<IEnumerable<PostDB>> List(PostStatus[] status)
         {
-            return await db.Posts.AsNoTracking().Where(r => status.Contains(r.Status)).Include(o => o.Comments.Where(c => c.Type != CommentType.Reject)).ToListAsync();
+            return await db.Posts.AsNoTracking().Where(r => status.Contains(r.Status)).Include(o => o.Comments.Where(c => c.Type == CommentType.Reject)).ToListAsync();
         }
 

[Killed] Equality mutation
blog/blog.api/Repository/PostRepository.cs:23:65
 
         public async Task<PostDB> GetById(long id)
         {
-            var post = await db.Posts.AsNoTracking().Where(r => r.ID == id).Include(o => o.Comments).FirstOrDefaultAsync();
+            var post = await db.Posts.AsNoTracking().Where(r => r.ID != id).Include(o => o.Comments).FirstOrDefaultAsync();
             if (post == null)
                 throw new NotFoundException("Post not found");
killedBy: blog.api.test.PostControllerTest.ApprovePostSuccess; blog.api.test.PostControllerTest.CommentPostSuccess; blog.api.test.PostControllerTest.EditPostFail

[Killed] Equality mutation
blog/blog.api/Repository/PostRepository.cs:24:17
         public async Task<PostDB> GetById(long id)
         {
             var post = await db.Posts.AsNoTracking().Where(r => r.ID == id).Include(o => o.Comments).FirstOrDefaultAsync();
-            if (post == null)
+            if (post != null)
                 throw new NotFoundException("Post not found");
             return post;
killedBy: blog.api.test.PostControllerTest.ApprovePostSuccess; blog.api.test.PostControllerTest.CommentPostSuccess; blog.api.test.PostControllerTest.EditPostSuccess

[Killed] Statement mutation
blog/blog.api/Repository/PostRepository.cs:25:17
         {
             var post = await db.Posts.AsNoTracking().Where(r => r.ID == id).Include(o => o.Comments).FirstOrDefaultAsync();
             if (post == null)
-                throw new NotFoundException("Post not found");
+                ;
             return post;
         }
killedBy: blog.api.test.PostControllerTest.GetPostByIdNotFound; blog.api.test.PostRepositoryTest.TestRepositoryShouldGetPostByIdNotFound; blog.api.test.PostServiceTest.TestPostServiceShouldGetPostByIdNotFound

[Killed] Statement mutation
blog/blog.api/Repository/PostRepository.cs:33:13
         {
             var newPost = db.Posts.Add(post);
 
-            await db.SaveChangesAsync(CancellationToken.None);
+            ;
 
             return newPost.Entity;
killedBy: blog.api.test.PostControllerTest.ApprovePostSuccess; blog.api.test.PostControllerTest.CommentPostSuccess; blog.api.test.PostControllerTest.EditPostSuccess

[Killed] Linq method mutation (FirstOrDefault() to First())
blog/blog.api/Repository/PostRepository.cs:39:32
         }
         public async Task<PostDB> Edit(PostDB post, CommentDB comment)
         {
-            var existingPost = db.Posts.Where(r => r.ID == post.ID).Include(c => c.Comments).FirstOrDefault();
+            var existingPost = db.Posts.Where(r => r.ID == post.ID).Include(c => c.Comments).First();
 
             if (existingPost == null)
killedBy: blog.api.test.PostRepositoryTest.TestRepositoryShouldEditPostNotFound

[Killed] Equality mutation
blog/blog.api/Repository/PostRepository.cs:39:52
         }
         public async Task<PostDB> Edit(PostDB post, CommentDB comment)
         {
-            var existingPost = db.Posts.Where(r => r.ID == post.ID).Include(c => c.Comments).FirstOrDefault();
+            var existingPost = db.Posts.Where(r => r.ID != post.ID).Include(c => c.Comments).FirstOrDefault();
 
             if (existingPost == null)
killedBy: blog.api.test.PostControllerTest.ApprovePostSuccess; blog.api.test.PostControllerTest.CommentPostSuccess; blog.api.test.PostControllerTest.EditPostSuccess

[Killed] Equality mutation
blog/blog.api/Repository/PostRepository.cs:41:17
         {
             var existingPost = db.Posts.Where(r => r.ID == post.ID).Include(c => c.Comments).FirstOrDefault();
 
-            if (existingPost == null)
+            if (existingPost != null)
                 throw new NotFoundException("Post not found");
 
killedBy: blog.api.test.PostControllerTest.ApprovePostSuccess; blog.api.test.PostControllerTest.CommentPostSuccess

[Killed] Statement mutation
blog/blog.api/Repository/PostRepository.cs:42:17
             var existingPost = db.Posts.Where(r => r.ID == post.ID).Include(c => c.Comments).FirstOrDefault();
 
             if (existingPost == null)
-                throw new NotFoundException("Post not found");
+                ;
 
             existingPost.Content = post.Content;
killedBy: blog.api.test.PostRepositoryTest.TestRepositoryShouldEditPostNotFound

[Killed] Equality mutation
blog/blog.api/Repository/PostRepository.cs:48:17
             existingPost.Title = post.Title;
             existingPost.Status = post.Status;
             existingPost.DatePublished = post.DatePublished;
-            if (comment != null)
+            if (comment == null)
             {
                 existingPost.Comments.Add(comment);
killedBy: blog.api.test.PostControllerTest.ApprovePostSuccess; blog.api.test.PostControllerTest.CommentPostSuccess; blog.api.test.PostControllerTest.EditPostSuccess

[Killed] Statement mutation
blog/blog.api/Repository/PostRepository.cs:50:17
             existingPost.DatePublished = post.DatePublished;
             if (comment != null)
             {
-                existingPost.Comments.Add(comment);
+                ;
             }
 
killedBy: blog.api.test.PostServiceTest.TestServiceShouldAddCommentToPublishedPost; blog.api.test.PostServiceTest.TestServiceShouldEditPostEvenRejected

[Killed] Equality mutation
blog/blog.api/Repository/PostRepository.cs:61:66
 
         public async Task<IEnumerable<PostDB>> ListByOwner(long ownerId)
         {
-            var posts = await db.Posts.AsNoTracking().Where(r => r.OwnerId == ownerId).Include(p => p.Comments).ToListAsync();
+            var posts = await db.Posts.AsNoTracking().Where(r => r.OwnerId != ownerId).Include(p => p.Comments).ToListAsync();
             if (posts.Count == 0)
                 throw new NotFoundException("No posts found");
killedBy: blog.api.test.PostRepositoryTest.TestRepositoryShouldListByOwner; blog.api.test.PostServiceTest.TestServiceShouldListByOwner

[Killed] Equality mutation
blog/blog.api/Repository/PostRepository.cs:62:17
         public async Task<IEnumerable<PostDB>> ListByOwner(long ownerId)
         {
             var posts = await db.Posts.AsNoTracking().Where(r => r.OwnerId == ownerId).Include(p => p.Comments).ToListAsync();
-            if (posts.Count == 0)
+            if (posts.Count != 0)
                 throw new NotFoundException("No posts found");
 
killedBy: blog.api.test.PostControllerTest.GetMinePostsNotFound; blog.api.test.PostRepositoryTest.TestRepositoryShouldListByOwner; blog.api.test.PostRepositoryTest.TestRepositoryShouldListByOwnerNoPostFound

[Killed] Statement mutation
blog/blog.api/Repository/PostRepository.cs:63:17
         {
             var posts = await db.Posts.AsNoTracking().Where(r => r.OwnerId == ownerId).Include(p => p.Comments).ToListAsync();
             if (posts.Count == 0)
-                throw new NotFoundException("No posts found");
+                ;
 
             return posts;
killedBy: blog.api.test.PostControllerTest.GetMinePostsNotFound; blog.api.test.PostRepositoryTest.TestRepositoryShouldListByOwnerNoPostFound; blog.api.test.PostServiceTest.TestServiceShouldListByOwnerNoPostFound
