[Killed] Block removal mutation
blog/blog.api/Repository/UserRepository.cs:12:9
     {
         private readonly DBContextBlog db;
         public UserRepository(DBContextBlog db)
-        {
-            this.db = db;
-        }
+        {}
 
         public async Task<IEnumerable<User>> List()
killedBy: blog.api.test.UserControllerTest.AddUserSuccess; blog.api.test.UserControllerTest.GetUserByIdNotFound; blog.api.test.UserControllerTest.GetUserByUsernameNotFound

[Killed] Block removal mutation
blog/blog.api/Repository/UserRepository.cs:17:9
         }
 
         public async Task<IEnumerable<User>> List()
-        {
-            return await db.Users.ToListAsync();
-        }
+        {}
 
         public async Task<User> GetById(long id)
killedBy: blog.api.test.UserControllerTest.ListUsersFail

[Killed] Equality mutation
blog/blog.api/Repository/UserRepository.cs:24:17
         public async Task<User> GetById(long id)
         {
             var user = await db.Users.FindAsync(id);
-            if (user == null)
+            if (user != null)
                 throw new NotFoundException("User not found");
             return user;
killedBy: blog.api.test.UserControllerTest.GetUserByIdNotFound; blog.api.test.UserRepositoryTest.TestUserRepositoryShouldGetUserByIdHappyPath; blog.api.test.UserRepositoryTest.TestUserRepositoryShouldGetUserByIdNullFail

[Killed] Statement mutation
blog/blog.api/Repository/UserRepository.cs:25:17
         {
             var user = await db.Users.FindAsync(id);
             if (user == null)
-                throw new NotFoundException("User not found");
+                ;
             return user;
         }
killedBy: blog.api.test.UserControllerTest.GetUserByIdNotFound; blog.api.test.UserRepositoryTest.TestUserRepositoryShouldGetUserByIdNullFail

[Killed] Statement mutation
blog/blog.api/Repository/UserRepository.cs:34:13
         {
             var newUser = await db.Users.AddAsync(user);
 
-            db.SaveChanges();
+            ;
 
             return newUser.Entity;
killedBy: blog.api.test.UserRepositoryTest.TestUserRepositoryShouldAuthenticateHappyPath; blog.api.test.UserRepositoryTest.TestUserRepositoryShouldGetUserByUsernameHappyPath

[Killed] Equality mutation
blog/blog.api/Repository/UserRepository.cs:41:64
 
         public async Task<User> GetByUserName(string username)
         {
-            var user = await db.Users.FirstOrDefaultAsync(r => r.Username == username);
+            var user = await db.Users.FirstOrDefaultAsync(r => r.Username != username);
             if (user == null)
                 throw new NotFoundException("User not found");
killedBy: blog.api.test.UserRepositoryTest.TestUserRepositoryShouldGetUserByUsernameHappyPath; blog.api.test.UserServiceTest.TestUserServiceShouldCheckHasRole(True); blog.api.test.UserServiceTest.TestUserServiceShouldCheckHasRole(False)

[Killed] Equality mutation
blog/blog.api/Repository/UserRepository.cs:42:17
         public async Task<User> GetByUserName(string username)
         {
             var user = await db.Users.FirstOrDefaultAsync(r => r.Username == username);
-            if (user == null)
+            if (user != null)
                 throw new NotFoundException("User not found");
             return user;
killedBy: blog.api.test.UserControllerTest.GetUserByUsernameNotFound; blog.api.test.UserRepositoryTest.TestUserRepositoryShouldGetUserByUsernameHappyPath; blog.api.test.UserRepositoryTest.TestUserRepositoryShouldGetUserByUsernameNullFail

[Killed] Equality mutation
blog/blog.api/Repository/UserRepository.cs:49:90
 
         public User? Authenticate(string username, string password)
         {
-            return db.Users.AsNoTracking().FirstOrDefault(r => r.Username == username && r.Password == password);
+            return db.Users.AsNoTracking().FirstOrDefault(r => r.Username == username && r.Password != password);
         }
     }
killedBy: blog.api.test.UserRepositoryTest.TestUserRepositoryShouldAuthenticateFailPath; blog.api.test.UserRepositoryTest.TestUserRepositoryShouldAuthenticateHappyPath; blog.api.test.UserServiceTest.TestUserServiceShouldAuthenticateFailPath

[Killed] Logical mutation
blog/blog.api/Repository/UserRepository.cs:49:64
 
         public User? Authenticate(string username, string password)
         {
-            return db.Users.AsNoTracking().FirstOrDefault(r => r.Username == username && r.Password == password);
+            return db.Users.AsNoTracking().FirstOrDefault(r => r.Username == username || r.Password == password);
         }
     }
killedBy: blog.api.test.UserRepositoryTest.TestUserRepositoryShouldAuthenticateFailPath; blog.api.test.UserServiceTest.TestUserServiceShouldAuthenticateFailPath
