[Killed] Block removal mutation
blog/blog.api/Service/PostService.cs:19:9
             IMapper<CommentDB, CommentInput> mapperCommentInputToDB,
             IMapper<PostDB, PostInput> mapperPostInputToDB,
             CurrentUser currentUser)
-        {
-            _postRepository = postRepository;
-            _mapperCommentInputToDB = mapperCommentInputToDB;
-            _mapperPostInputToDB = mapperPostInputToDB;
-            _currentUser = currentUser;
-        }
+        {}
 
         public async Task<IEnumerable<PostDB>> List(PostStatus[] status)
killedBy: blog.api.test.PostControllerTest.AddPostSuccess; blog.api.test.PostControllerTest.ApprovePostFail; blog.api.test.PostControllerTest.ApprovePostSuccess

[Killed] Block removal mutation
blog/blog.api/Service/PostService.cs:27:9
         }
 
         public async Task<IEnumerable<PostDB>> List(PostStatus[] status)
-        {
-            return await _postRepository.List(status);
-        }
+        {}
 
         public async Task<PostDB> GetById(long userId, long id)
killedBy: blog.api.test.PostControllerTest.ListPendingPostsFail; blog.api.test.PostControllerTest.ListPendingPostsSuccess; blog.api.test.PostControllerTest.ListPostsFail

[Survived] Negate expression
blog/blog.api/Service/PostService.cs:35:17
         {
             var dbPost = await _postRepository.GetById(id);
 
-            if (dbPost.Comments.Any())
+            if (!(dbPost.Comments.Any()))
             {
                 if (dbPost.OwnerId != userId)

[Killed] Equality mutation
blog/blog.api/Service/PostService.cs:37:21
 
             if (dbPost.Comments.Any())
             {
-                if (dbPost.OwnerId != userId)
+                if (dbPost.OwnerId == userId)
                     dbPost.Comments.RemoveAll(r => r.Type == CommentType.Reject);
             }
killedBy: blog.api.test.PostServiceTest.TestServiceShouldEditPostEvenRejected

[NoCoverage] Statement mutation
blog/blog.api/Service/PostService.cs:38:21
             if (dbPost.Comments.Any())
             {
                 if (dbPost.OwnerId != userId)
-                    dbPost.Comments.RemoveAll(r => r.Type == CommentType.Reject);
+                    ;
             }
 

[NoCoverage] Equality mutation
blog/blog.api/Service/PostService.cs:38:52
             if (dbPost.Comments.Any())
             {
                 if (dbPost.OwnerId != userId)
-                    dbPost.Comments.RemoveAll(r => r.Type == CommentType.Reject);
+                    dbPost.Comments.RemoveAll(r => r.Type != CommentType.Reject);
             }
 

[Killed] Block removal mutation
blog/blog.api/Service/PostService.cs:45:9
         }
 
         public async Task<PostDB> Add(PostInput post)
-        {
-            var postDB = _mapperPostInputToDB.Map(post);
-            postDB.OwnerId = _currentUser.Id;
-
-            var dbPost = await _postRepository.Add(postDB);
-            return dbPost;
-        }
+        {}
 
         public async Task<IEnumerable<PostDB>> ListByOwner(long userId)
killedBy: blog.api.test.PostControllerTest.AddPostFail; blog.api.test.PostControllerTest.ApprovePostFail; blog.api.test.PostControllerTest.ApprovePostSuccess

[Killed] Block removal mutation
blog/blog.api/Service/PostService.cs:54:9
         }
 
         public async Task<IEnumerable<PostDB>> ListByOwner(long userId)
-        {
-            var dbPost = await _postRepository.ListByOwner(userId);
-
-            return dbPost;
-        }
+        {}
 
         public async Task<PostDB> Edit(long postId, PostInput post)
killedBy: blog.api.test.PostControllerTest.GetMinePostsFail; blog.api.test.PostControllerTest.GetMinePostsNotFound; blog.api.test.PostServiceTest.TestServiceShouldListByOwner

[Killed] Equality mutation
blog/blog.api/Service/PostService.cs:64:17
         {
             var dbPost = await _postRepository.GetById(postId);
 
-            if (dbPost.Status != PostStatus.Rejected
+            if (dbPost.Status == PostStatus.Rejected
             && dbPost.Status != PostStatus.None)
                 throw new Exception($"Cannot edit this post as its status is {Enum.GetName(typeof(PostStatus), dbPost.Status)}.");
killedBy: blog.api.test.PostServiceTest.TestServiceShouldEditPostCannotBecauseNotNoneAndNotRejected(False); blog.api.test.PostServiceTest.TestServiceShouldEditPostCannotBecauseNotNoneAndNotRejected(True); blog.api.test.PostServiceTest.TestServiceShouldEditPostEvenRejected

[Killed] Logical mutation
blog/blog.api/Service/PostService.cs:64:17
         {
             var dbPost = await _postRepository.GetById(postId);
 
-            if (dbPost.Status != PostStatus.Rejected
-            && dbPost.Status != PostStatus.None)
+            if (dbPost.Status != PostStatus.Rejected
+            || dbPost.Status != PostStatus.None)
                 throw new Exception($"Cannot edit this post as its status is {Enum.GetName(typeof(PostStatus), dbPost.Status)}.");
 
killedBy: blog.api.test.PostControllerTest.EditPostSuccess; blog.api.test.PostServiceTest.TestServiceShouldEditPost; blog.api.test.PostServiceTest.TestServiceShouldEditPostEvenRejected

[Killed] Equality mutation
blog/blog.api/Service/PostService.cs:65:16
             var dbPost = await _postRepository.GetById(postId);
 
             if (dbPost.Status != PostStatus.Rejected
-            && dbPost.Status != PostStatus.None)
+            && dbPost.Status == PostStatus.None)
                 throw new Exception($"Cannot edit this post as its status is {Enum.GetName(typeof(PostStatus), dbPost.Status)}.");
 
killedBy: blog.api.test.PostControllerTest.EditPostSuccess; blog.api.test.PostServiceTest.TestServiceShouldEditPost; blog.api.test.PostServiceTest.TestServiceShouldEditPostCannotBecauseNotNoneAndNotRejected(False)

[Killed] Statement mutation
blog/blog.api/Service/PostService.cs:66:17
 
             if (dbPost.Status != PostStatus.Rejected
             && dbPost.Status != PostStatus.None)
-                throw new Exception($"Cannot edit this post as its status is {Enum.GetName(typeof(PostStatus), dbPost.Status)}.");
+                ;
 
             dbPost.Title = post.Title;
killedBy: blog.api.test.PostServiceTest.TestServiceShouldEditPostCannotBecauseNotNoneAndNotRejected(False); blog.api.test.PostServiceTest.TestServiceShouldEditPostCannotBecauseNotNoneAndNotRejected(True)

[Killed] Negate expression
blog/blog.api/Service/PostService.cs:79:17
         {
             var dbPost = await _postRepository.GetById(postId);
 
-            if (dbPost.Status != PostStatus.None
-            && dbPost.Status != PostStatus.Rejected)
+            if (!(dbPost.Status != PostStatus.None
+            && dbPost.Status != PostStatus.Rejected))
                 throw new Exception($"Cannot submit this post as its status is {Enum.GetName(typeof(PostStatus), dbPost.Status)}.");
 
killedBy: blog.api.test.PostControllerTest.ApprovePostSuccess; blog.api.test.PostControllerTest.CommentPostSuccess; blog.api.test.PostControllerTest.ListPendingPostsSuccess

[Killed] Logical mutation
blog/blog.api/Service/PostService.cs:79:17
         {
             var dbPost = await _postRepository.GetById(postId);
 
-            if (dbPost.Status != PostStatus.None
-            && dbPost.Status != PostStatus.Rejected)
+            if (dbPost.Status != PostStatus.None
+            || dbPost.Status != PostStatus.Rejected)
                 throw new Exception($"Cannot submit this post as its status is {Enum.GetName(typeof(PostStatus), dbPost.Status)}.");
 
killedBy: blog.api.test.PostControllerTest.ApprovePostSuccess; blog.api.test.PostControllerTest.CommentPostSuccess; blog.api.test.PostControllerTest.ListPendingPostsSuccess

[Killed] Equality mutation
blog/blog.api/Service/PostService.cs:80:16
             var dbPost = await _postRepository.GetById(postId);
 
             if (dbPost.Status != PostStatus.None
-            && dbPost.Status != PostStatus.Rejected)
+            && dbPost.Status == PostStatus.Rejected)
                 throw new Exception($"Cannot submit this post as its status is {Enum.GetName(typeof(PostStatus), dbPost.Status)}.");
 
killedBy: blog.api.test.PostServiceTest.TestServiceShouldSubmitPostCannotBecauseNotNoneAndNotRejected(False); blog.api.test.PostServiceTest.TestServiceShouldSubmitPostCannotBecauseNotNoneAndNotRejected(True)

[Killed] Statement mutation
blog/blog.api/Service/PostService.cs:81:17
 
             if (dbPost.Status != PostStatus.None
             && dbPost.Status != PostStatus.Rejected)
-                throw new Exception($"Cannot submit this post as its status is {Enum.GetName(typeof(PostStatus), dbPost.Status)}.");
+                ;
 
             dbPost.Status = PostStatus.Pending_Approval;
killedBy: blog.api.test.PostServiceTest.TestServiceShouldSubmitPostCannotBecauseNotNoneAndNotRejected(False); blog.api.test.PostServiceTest.TestServiceShouldSubmitPostCannotBecauseNotNoneAndNotRejected(True)

[Killed] Equality mutation
blog/blog.api/Service/PostService.cs:93:17
         {
             var dbPost = await _postRepository.GetById(postId);
 
-            if (dbPost.Status != PostStatus.Approved)
+            if (dbPost.Status == PostStatus.Approved)
                 throw new Exception("Cannot comment a post that is not published.");
 
killedBy: blog.api.test.PostControllerTest.CommentPostSuccess; blog.api.test.PostServiceTest.TestServiceShouldAddCommentCannotBecauseStatusNone; blog.api.test.PostServiceTest.TestServiceShouldAddCommentCannotBecauseStatusPendingApproval

[Killed] Statement mutation
blog/blog.api/Service/PostService.cs:94:17
             var dbPost = await _postRepository.GetById(postId);
 
             if (dbPost.Status != PostStatus.Approved)
-                throw new Exception("Cannot comment a post that is not published.");
+                ;
 
             var commentDB = _mapperCommentInputToDB.Map(comment);
killedBy: blog.api.test.PostServiceTest.TestServiceShouldAddCommentCannotBecauseStatusNone; blog.api.test.PostServiceTest.TestServiceShouldAddCommentCannotBecauseStatusPendingApproval; blog.api.test.PostServiceTest.TestServiceShouldAddCommentCannotBecauseStatusRejected

[Killed] String mutation
blog/blog.api/Service/PostService.cs:94:37
             var dbPost = await _postRepository.GetById(postId);
 
             if (dbPost.Status != PostStatus.Approved)
-                throw new Exception("Cannot comment a post that is not published.");
+                throw new Exception("");
 
             var commentDB = _mapperCommentInputToDB.Map(comment);
killedBy: blog.api.test.PostServiceTest.TestServiceShouldAddCommentCannotBecauseStatusNone

[Killed] Statement mutation
blog/blog.api/Service/PostService.cs:99:13
             var commentDB = _mapperCommentInputToDB.Map(comment);
             commentDB.PostId = postId;
 
-            await _postRepository.Edit(dbPost, commentDB);
+            ;
 
             return commentDB;
killedBy: blog.api.test.PostServiceTest.TestServiceShouldAddCommentToPublishedPost

[Killed] Equality mutation
blog/blog.api/Service/PostService.cs:108:17
         {
             var dbPost = await _postRepository.GetById(postId);
 
-            if (dbPost.Status != PostStatus.Pending_Approval)
+            if (dbPost.Status == PostStatus.Pending_Approval)
                 throw new Exception($"Cannot approve this post as its status is {Enum.GetName(typeof(PostStatus), dbPost.Status)}.");
 
killedBy: blog.api.test.PostControllerTest.ApprovePostSuccess; blog.api.test.PostControllerTest.CommentPostSuccess; blog.api.test.PostControllerTest.ListPostsSuccess

[Killed] Statement mutation
blog/blog.api/Service/PostService.cs:109:17
             var dbPost = await _postRepository.GetById(postId);
 
             if (dbPost.Status != PostStatus.Pending_Approval)
-                throw new Exception($"Cannot approve this post as its status is {Enum.GetName(typeof(PostStatus), dbPost.Status)}.");
+                ;
 
             dbPost.Status = PostStatus.Approved;
killedBy: blog.api.test.PostServiceTest.TestServiceShouldApprovePostCannotBecauseStatusApproved; blog.api.test.PostServiceTest.TestServiceShouldApprovePostCannotBecauseStatusNone; blog.api.test.PostServiceTest.TestServiceShouldApprovePostCannotBecauseStatusRejected

[Killed] Statement mutation
blog/blog.api/Service/PostService.cs:123:17
             var dbPost = await _postRepository.GetById(postId);
 
             if (dbPost.Status != PostStatus.Pending_Approval)
-                throw new Exception($"Cannot reject this post as its status is {Enum.GetName(typeof(PostStatus), dbPost.Status)}.");
+                ;
 
             if (string.IsNullOrEmpty(comment.Content))
killedBy: blog.api.test.PostServiceTest.TestServiceShouldRejectPostCannotBecauseStatusApproved; blog.api.test.PostServiceTest.TestServiceShouldRejectPostCannotBecauseStatusNone; blog.api.test.PostServiceTest.TestServiceShouldRejectPostCannotBecauseStatusRejected

[Killed] String mutation
blog/blog.api/Service/PostService.cs:123:37
             var dbPost = await _postRepository.GetById(postId);
 
             if (dbPost.Status != PostStatus.Pending_Approval)
-                throw new Exception($"Cannot reject this post as its status is {Enum.GetName(typeof(PostStatus), dbPost.Status)}.");
+                throw new Exception($"");
 
             if (string.IsNullOrEmpty(comment.Content))
killedBy: blog.api.test.PostServiceTest.TestServiceShouldRejectPostCannotBecauseStatusApproved; blog.api.test.PostServiceTest.TestServiceShouldRejectPostCannotBecauseStatusNone; blog.api.test.PostServiceTest.TestServiceShouldRejectPostCannotBecauseStatusRejected

[Killed] Negate expression
blog/blog.api/Service/PostService.cs:125:17
             if (dbPost.Status != PostStatus.Pending_Approval)
                 throw new Exception($"Cannot reject this post as its status is {Enum.GetName(typeof(PostStatus), dbPost.Status)}.");
 
-            if (string.IsNullOrEmpty(comment.Content))
+            if (!(string.IsNullOrEmpty(comment.Content)))
                 throw new Exception("You must provide a comment when rejecting a post.");
 
killedBy: blog.api.test.PostControllerTest.RejectPostSuccess; blog.api.test.PostServiceTest.TestServiceShouldAddCommentCannotBecauseStatusRejected; blog.api.test.PostServiceTest.TestServiceShouldApprovePostCannotBecauseStatusRejected

[Killed] String mutation
blog/blog.api/Service/PostService.cs:125:17
             if (dbPost.Status != PostStatus.Pending_Approval)
                 throw new Exception($"Cannot reject this post as its status is {Enum.GetName(typeof(PostStatus), dbPost.Status)}.");
 
-            if (string.IsNullOrEmpty(comment.Content))
+            if ((comment.Content!=null))
                 throw new Exception("You must provide a comment when rejecting a post.");
 
killedBy: blog.api.test.PostControllerTest.RejectPostSuccess; blog.api.test.PostServiceTest.TestServiceShouldAddCommentCannotBecauseStatusRejected; blog.api.test.PostServiceTest.TestServiceShouldApprovePostCannotBecauseStatusRejected

[Killed] Statement mutation
blog/blog.api/Service/PostService.cs:126:17
                 throw new Exception($"Cannot reject this post as its status is {Enum.GetName(typeof(PostStatus), dbPost.Status)}.");
 
             if (string.IsNullOrEmpty(comment.Content))
-                throw new Exception("You must provide a comment when rejecting a post.");
+                ;
 
             dbPost.Status = PostStatus.Rejected;
killedBy: blog.api.test.PostServiceTest.TestServiceShouldRejectPostWithCommentContentIsEmpty
