[Killed] Block removal mutation
blog/blog.api/Service/UserService.cs:11:9
         private readonly IUserRepository _repository;
 
         public UserService(IUserRepository repository)
-        {
-            _repository = repository;
-        }
+        {}
 
         public async Task<IEnumerable<User>> List()
killedBy: blog.api.test.UserControllerTest.AddUserSuccess; blog.api.test.UserControllerTest.GetUserByIdNotFound; blog.api.test.UserControllerTest.GetUserByUsernameNotFound

[Killed] Block removal mutation
blog/blog.api/Service/UserService.cs:16:9
         }
 
         public async Task<IEnumerable<User>> List()
-        {
-            return await _repository.List();
-        }
+        {}
 
         public async Task<User> GetById(long id)
killedBy: blog.api.test.UserControllerTest.ListUsersFail

[Killed] Block removal mutation
blog/blog.api/Service/UserService.cs:21:9
         }
 
         public async Task<User> GetById(long id)
-        {
-            var dbUser = await _repository.GetById(id);
-            return dbUser;
-        }
+        {}
 
         public async Task<User> Save(User user)
killedBy: blog.api.test.UserControllerTest.GetUserByIdFail; blog.api.test.UserControllerTest.GetUserByIdNotFound; blog.api.test.UserServiceTest.TestUserServiceShouldAddUserWithoutRoleHappyPath

[Killed] Equality mutation
blog/blog.api/Service/UserService.cs:30:17
         {
             user.ID = 0;
 
-            if (user.Role.Count() == 0)
+            if (user.Role.Count() != 0)
                 user.Role.Add(UserRole.Public);
 
killedBy: blog.api.test.UserServiceTest.TestUserServiceShouldAddUserWithoutRoleHappyPath; blog.api.test.UserServiceTest.TestUserServiceShouldAuthenticateHappyPath; blog.api.test.UserServiceTest.TestUserServiceShouldGetUserByIdHappyPath

[Killed] Statement mutation
blog/blog.api/Service/UserService.cs:31:17
             user.ID = 0;
 
             if (user.Role.Count() == 0)
-                user.Role.Add(UserRole.Public);
+                ;
 
             var dbUser = await _repository.Save(user);
killedBy: blog.api.test.UserServiceTest.TestUserServiceShouldAddUserWithoutRoleHappyPath

[Killed] Block removal mutation
blog/blog.api/Service/UserService.cs:38:9
         }
 
         public async Task<User> GetByUsername(string username)
-        {
-            var dbUser = await _repository.GetByUserName(username);
-            return dbUser;
-        }
+        {}
 
         public async Task<bool> HasRole(long userId, UserRole role)
killedBy: blog.api.test.UserControllerTest.GetUserByUsernameFail; blog.api.test.UserControllerTest.GetUserByUsernameNotFound

[Killed] Block removal mutation
blog/blog.api/Service/UserService.cs:44:9
         }
 
         public async Task<bool> HasRole(long userId, UserRole role)
-        {
-            var user = await GetById(userId);
-
-            return user.Role.Contains(role);
-        }
+        {}
 
         public User? Authenticate(string username, string password)
killedBy: blog.api.test.UserServiceTest.TestUserServiceShouldCheckHasRole(True)

[Killed] Block removal mutation
blog/blog.api/Service/UserService.cs:51:9
         }
 
         public User? Authenticate(string username, string password)
-        {
-            return _repository.Authenticate(username, password);
-        }
+        {}
     }
 }
killedBy: blog.api.test.UserServiceTest.TestUserServiceShouldAuthenticateHappyPath
